#### Convert categorical data into numerical data using labelencoder

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    "Country":['France','Span','Germany','America','Dubai','Switzerland'],
    "Age":[34,45,23,44,29,33],
    "Salary":[72000,48000,67000,56000,78000,89000],
    "Purchased":["No","Yes","Yes","No","No","Yes"]
})
df

       Country  Age  Salary Purchased
0       France   34   72000        No
1         Span   45   48000       Yes
2      Germany   23   67000       Yes
3      America   44   56000        No
4        Dubai   29   78000        No
5  Switzerland   33   89000       Yes

In [2]:
# converting last column

from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df.iloc[:,-1] =  le.fit_transform(df.iloc[:,-1].values)
df

       Country  Age  Salary  Purchased
0       France   34   72000          0
1         Span   45   48000          1
2      Germany   23   67000          1
3      America   44   56000          0
4        Dubai   29   78000          0
5  Switzerland   33   89000          1

In [3]:
# converting first column

from  sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df.iloc[:,0] = le.fit_transform(df.iloc[:,0])
df

   Country  Age  Salary  Purchased
0        2   34   72000          0
1        4   45   48000          1
2        3   23   67000          1
3        0   44   56000          0
4        1   29   78000          0
5        5   33   89000          1